["⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 17:18 (Gaza Time)\n\nTargeting in the Al -Mashala area, south of Deir Al -Balah, in the center of the sector.", "⚠️ [Safety]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:19 (Gaza Time)\n\n** Targeted in the Abu Ghorab area, the vicinity of the Al -Mashala area **", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:19 (Gaza Time)\n\nThe closure of Street 60 between Makhammas and Qaba, north of occupied Jerusalem, as a result of a truck overturning in a traffic accident", "🔗 [Victims]\n📰 [**Osama Al-Kahlout**]\n🕒 Date : 20/07/2025 17:19 (Gaza Time)\n\n*A press statement issued by the General Directorate of Civil Defense on: Targeting the Civil Defense Point in the Humanitarian Region \"Applied College\" in Ma’is Khan Yunis, the martyrdom of an officer and the injury of the entire crew with varying stigels*\n\nIn continuation of its aggressive methodology, committing crimes and violating international humanitarian law, the Israeli IF directly targeted, this afternoon, the civil defense point that it resides in the \"Humanitarian Region- Applied College\" in Ma’is Khan Yunis in the southern **Gaza** Strip, which led to the martyrdom of the colleague, the officer/ Hani Muhammad Muhammad al-Dabour, and the injury of all crew members of varying wounds.\n\nThe General Directorate of Civil Defense strongly condemns this brute crime against its crew, which performs the emergency humanitarian service to thousands of displaced people in the area that the IF calls \"humanity\" in Ma’is Khan Yunis.\n\nThe directorate, as it mourns with great sadness and sorrow, the martyrdom of one of its officers and the injury of 5 wounds in this brutal targeting, to confirm the following:\n\n- The Israeli IF targeted a civil defense crew \"Al -Qarara\" today raises the number of times the direct Israeli targeting of our teams inside the points and their work centers to 11 times, during the war, and more than 25 times while working in the fields of events.\n\n- By committing the IF this crime, the total number of our victims rises to 134 victims and 336 injured since the beginning of the annihilation war, which is still committed against our people in the **Gaza** Strip.\n\n- This brutal attack is a new crime that is added to a series of continuous violations of humanitarian crews working in the **Gaza** Strip, and constitutes a clear violation of international humanitarian law that criminalizes targeting rescue and emergency teams.\n\n- This Israeli targeting will only increase us, insisting on continuing our national and humanitarian duty; Despite all the risks and challenges, and that the blood of our victims will remain a beacon that lights the path of giving and steadfastness for the free human world.\n \n- We call on the international community with all its human rights and humanitarian institutions to bear their responsibilities to stop these Israeli crimes, and to provide full protection for our operating teams.", "🔗 [Victims]\n📰 [**Osama Al-Kahlout**]\n🕒 Date : 20/07/2025 17:20 (Gaza Time)\n\nA child was killed and another child was injured as a result of the IF bombing an apartment inside a building that houses displaced people near the olive school in **Gaza**.", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 17:20 (Gaza Time)\n\nWorld Food Program: 25 aid trucks affiliated with us crossed the Zakim crossing today to northern **Gaza**", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 17:20 (Gaza Time)\n\nSources in **Gaza** Hospitals: 87 victims with the IF fire since dawn today, including 73 aid applicants", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 17:21 (Gaza Time)\n\nWorld Food Program: 25 aid trucks followed by the Zikim crossing today to northern **Gaza**", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:21 (Gaza Time)\n\nScenes from the courtyards of the blessed Al -Aqsa Mosque this afternoon", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:22 (Gaza Time)\n\nThe Oruminity Observatory for Human Rights:\n\n- The lure of civilized civilians, then their execution, north of **Gaza**, reveals a brutal pattern of the genocide committed by \"Israel\".\n\n- We documented the IF opened fire on civilians when they approached the aid truck in a deliberate murder, which is not justified by any military consideration and reflects an unprecedented level of brutality.\n\n- The army stopped the aid trucks he entered from the \"Zikim\" area near its tanks and the soldiers issued orders for the boat through the loudspeakers, in which he said: \"Lift your hands and pass from the tanks ...\n\n- \"Israel\" uses aid and its distribution points as death fillings to which the crowds are lured within an integrated system of intentional killing, systematic deprivation and mass humiliation.\n\n- The international community and colluding governments bear responsibility for the continuing crimes against civilians who are crowned in the **Gaza** Strip.", "💥 [Shelling]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:23 (Gaza Time)\n\nTargeting the house of Abu Ibrahim Abu Ghorab in the last targeting shortly", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 17:24 (Gaza Time)\n\nTargeting the house of Abu Ibrahim Abu Ghorab in the Abu Ghurab area in Al -Mashala, south of Deir Al -Balah, in the center of the **Gaza** Strip.", "🗣️ [Statement]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:26 (Gaza Time)\n\nInjuries go to Al -Aqsa now from targeting", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 17:25 (Gaza Time)\n\n**#Urgent **** ... \n\nThe martyrdom of Hajj: Hamada Al -Muhr Nasr Abu Raed\nAs a result of targeting in the Al -Nazla area, west of **Jabalia**, a short time ago .. **", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:27 (Gaza Time)\n\nA British actor raises the Palestine flag inside the Royal Opera House in London; In solidarity with **Gaza** and the Palestinian people.", "💥 [Shelling]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:29 (Gaza Time)\n\nAn air strike from the IF targeting a house for the Abu Ghurab family in the vicinity of the Al -Mashala area in Deir Al -Balah in the central **Gaza** Strip.", "🗣️ [Statement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:31 (Gaza Time)\n\nDirector of Al -Shifa Hospital d. Muhammad Abu Salma: The lack of fuel hospitals will lead to the complete stopping of the Public Service Hospital, the Baptist and Al -Aqsa within 12 hours, and healing within 30 hours.", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:33 (Gaza Time)\n\nInfected with Israeli bombing targeting a house for the Abu Ghurab family in the vicinity of the Al -Mashala area in Deir Al -Balah in the central **Gaza** Strip.", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:34 (Gaza Time)\n\nWorld Food Program: We call for the protection of civilians and humanitarian workers who provide assistance", "⚠️ [Safety]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 17:38 (Gaza Time)\n\nA medical source at the Al -Aqsa victims Hospital: a victim and injured as a result of Israeli bombing targeting a house south of Deir Al -Balah in the central **Gaza** Strip", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 17:41 (Gaza Time)\n\nThe Grand Mufti of Oman: We appeal to Islamic and Arab countries to lavish urgently to support their brothers in the **Gaza** Strip, as this is a right for all humanity", "💥 [Shelling]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 17:40 (Gaza Time)\n\nThe Grand Mufti of the Sultanate of Oman: We follow, unfortunately, and the pain of the mourning of **Gaza**, from the suffocating siege, which is unjust", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:41 (Gaza Time)\n\nHaaretz: \"Israel\" refuses to extend the visa of the head of the United Nations Humanitarian Coordination Office (OCHA) in **Gaza** and the **West Bank** because of his criticism of the behavior of the Israeli army in the Strip.", "🔗 [Victims]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:43 (Gaza Time)\n\nCivil Defense in **Gaza**: We mourn the victim officer Ahmed Ramadan Mohamed Miqdad, who was shot by the Israeli IF in the northern **Gaza** Strip", "🔗 [Victims]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:44 (Gaza Time)\n\nUpdate | **\nA victim and several injuries targeting the house of Abu Ibrahim Abu Ghorab **", "💥 [Shelling]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:51 (Gaza Time)\n\nA victim and a number of wounded by the IF bombing a house for the \"Abu Ghurab\" family, near the Al -Mashala area, in Deir Al -Balah, in the central **Gaza** Strip.", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 17:52 (Gaza Time)\n\nIsraeli Finance Minister Smotrich: The government has ratified major incentives for the inhabitants of the **Gaza** cover and border towns with Lebanon and the support of local authorities", "🗣️ [Statement]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 17:53 (Gaza Time)\n\n** The government approves new arrangements for public officials in light of the financial crisis:\n\n- Organizing working hours in line with the nature of the work of each employee, either working in the main centers in part, working after or working in the directorates \n\n- The employees of the upper category are excluded and who requires the necessities of work to be excluded, according to the estimation of the head of the government department\n\n- Activating monitoring and completion reports to follow up on the work of your departments employees within the approved program for the work **", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:53 (Gaza Time)\n\nThe Grand Mufti of the Sultanate of Oman: We follow, unfortunately, and the pain of the mourning of **Gaza**, from the suffocating siege, which is unjust\n\n- We appeal to Islamic and Arab countries to later soon to support their brothers in the **Gaza** Strip, as this is a right for all humanity", "💥 [Shelling]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:54 (Gaza Time)\n\nThe IF artillery from east of Deir Al -Balah is now", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:54 (Gaza Time)\n\nAl -Quds Brigades: Shortly through Al -Jazeera News Channel ... scenes of the composite qualitative operation in which we targeted a Zionist soldier with the aim of capturing a number of soldiers in the Great Abasan area, east of Khan Yunis", "⚠️ [Safety]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 17:54 (Gaza Time)\n\n\"Israel, do not target my friends\" .. An activist from the Freedom Fleet wishes the safety of the Hanzala ship team with its launch from the Italian port of Gallipoli towards **Gaza** \n\nhttps://youtube.com/shorts/wj5-q15R3T4", "💥 [Shelling]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 17:55 (Gaza Time)\n\n** Hearing an explosion now **", "🔗 [Victims]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 17:59 (Gaza Time)\n\nThe martyrdom of the child Razan Abu Zahir; As a result of famine and malnutrition, in the center of the **Gaza** Strip.", "🔫 [Shooting]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:01 (Gaza Time)\n\nThe IF burn a house, inside Nour Shams camp in **Tulkarm**.", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:02 (Gaza Time)\n\nThe IF are two raids on the vicinity of the Al -Faruq Mosque in the **Jabalia** Al -Nazla area, in the northern **Gaza** Strip.", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:07 (Gaza Time)\n\n**#Urgent **** ... \n\nThey are injured as a result of targeting the house of Khalil Abu Al -Hajj Abu Wardah Al -Fahham in the Al -Nazla area, west of **Jabalia**, in the north of the Strip. **", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:08 (Gaza Time)\n\nNew painful scenes .. The people of **Gaza** are collapsing on the ground from the severity of hunger; Because of the intensification of the siege of the IF and its continued aggression.", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:09 (Gaza Time)\n\n**#Urgent **** ... \n\n\nTargeting the house of Wasfi Khala, Muqayel Al -Saadia School in Al -Nazla area, west of **Jabalia**, in the north of the Strip, and appeals that reach the need for ambulances to the place. **", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:10 (Gaza Time)\n\nThe Muslim Brotherhood: The Zionist persistence in **Gaza** would not have happened had it not been for this disgraceful failure and the tight closure of the crossings and the borders", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:11 (Gaza Time)\n\nThe Muslim Brotherhood: The continued closure of the crossings and the deprivation of the convoys of relief, medicine and food from reaching the people of **Gaza** to participate in the crime, no matter how complicity tries to decorate it with flimsy pretexts", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:11 (Gaza Time)\n\nThe Muslim Brotherhood: We demand the opening of the crossings immediately and raise all barriers to the flow of humanitarian aid to the Strip and support the people of **Gaza** with all possible support means", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:11 (Gaza Time)\n\n**#Urgent **** ... \n\nA series of air strikes targeting Al -Nazla area, west of **Jabalia**, in the northern **Gaza** Strip. **", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:12 (Gaza Time)\n\nThe Muslim Brotherhood: We call for a public negation and urgent work, so we should not let the people of **Gaza** face the starvation and death machine alone", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:11 (Gaza Time)\n\n**#Urgent **** ... \n\n4 victims following an Israeli bombing of the awaits of aid near Al -Tahlia roundabout, east of Khan Yunis, south of the **Gaza** Strip.\n\n1. Ismail Akram Abdel -Masry\n2. Rams Mohamed Ahmed Muammar\n3. Muhammad Ahmed Mohsen Muammar\n4. Mohsen Muhammad Mohsen Muammar **", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:14 (Gaza Time)\n\nThe Muslim Brotherhood: Jihad is an imposition of an eye that is not permissible to be left behind and does not fall from anyone until the aggression is defeated and the darkness raises, and this assignment does not stop at the people of **Gaza**", "🔴🔴🔴🔴🔴 **📢 [Announcement]**\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:15 (Gaza Time)\n\n**Palestinians are displacing from the areas south of Deir Al -Balah in the central **Gaza** Strip after the IF issued warnings to evacuate the area**", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:18 (Gaza Time)\n\nThey are injured as a result of the bombing of Khalil Abu Warda's house in the Al -Nazla area, west of **Jabalia**, in the northern **Gaza** Strip.", "⚠️ [Safety]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:17 (Gaza Time)\n\n** After it was destroyed by \"Israel\" .... Iranian media: replacing Iranian air defense systems affected by the war with Israel with a new one and publishing them in pre -specific locations **", "📢 [Announcement]\n📰 [**Moamen Meqdad**]\n🕒 Date : 20/07/2025 18:19 (Gaza Time)\n\n** The Chief of Staff of the Israeli Army for soldiers in the **Gaza** Strip: **\n“إذا توصلنا في الأيام المقبلة إلى صفقة، فسيكون ذلك إنجازا عظيما لكم؛ كل أسير يتم إطلاق سراحه سيكون بفضل قتالكم”", "🔫 [Shooting]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:19 (Gaza Time)\n\n** The Chief of Staff of the Israeli Army for soldiers in the Strip:\n“If we reach in the coming days a deal, this will be a great achievement for you; every prisoner is released, thanks to your fighting.” **", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 18:21 (Gaza Time)\n\nThe Israeli Chief of Staff of his soldiers in the **Gaza** Strip: If we reach an agreement in the coming days, it will be a great achievement for you", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:21 (Gaza Time)\n\nArtillery shelling the vicinity of Al -Nazla roundabout north of the pieces.", "🗣️ [Statement]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:21 (Gaza Time)\n\n**#Urgent **** | Israeli Army Chief of Staff\n\n** If we reach a prisoner exchange deal in the coming days, this is an achievement for our soldiers in the field.", "💥 [Shelling]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:22 (Gaza Time)\n\nThe martyrdom of Muhammad Shaban Abu Khaswan, 54, after the shelling of the house of the Abu Ghurab family, south of Deir Al -Balah, in the central **Gaza** Strip", "🔗 [Victims]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 18:23 (Gaza Time)\n\nThe victim/ Muhammad Shaban Abu Khaswan (54 years old), after targeting the house of the Abu Ghurab family.", "💥 [Shelling]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:23 (Gaza Time)\n\n**Gaza** .. Civil defense official announces a hunger strike\n\nhttps://ajm.news/yno6di", "💥 [Shelling]\n📰 [**Deir Al-Balah News**]\n🕒 Date : 20/07/2025 18:24 (Gaza Time)\n\nPlease avoid climbing to the roofs", "⚠️ [Safety]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:24 (Gaza Time)\n\n** The Israeli Chief of Staff: The events of As -Suwayda prove that whoever does not defend himself does not enjoy security **", "🗣️ [Statement]\n📰 [**Moamen Meqdad**]\n🕒 Date : 20/07/2025 18:26 (Gaza Time)\n\n** Army Radio: **\nNetanyahu requests the cancellation of his trial session tomorrow, due to the health problem", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:26 (Gaza Time)\n\n** How did you arrive ..\n\n- This child was found, Bilal Awad, next to Bir al -Shaer, and Zanan, west of Khan Yunis.\n\n- Whoever gets to know the number: 0598549634 **", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:26 (Gaza Time)\n\n** How did you arrive ..\n\nThese two children were found on Yarmouk Street, west of **Gaza**.\n\n- For those who recognize them to communicate via the number: 0599793540 **", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 18:27 (Gaza Time)\n\nThe Popular Front: The War of Genuine Using Bajjah is escalating in **Gaza** with international complicity and required to be a massive global uprising", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:27 (Gaza Time)\n\nWith the participation of 3 factions .. The resistance is a gathering of the IF in **Jabalia** in retaliation for the children of **Gaza** (witness)\n\nhttps://ajm.news/8n726i", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 18:27 (Gaza Time)\n\nStatement of the Palestinian factions: What the **Gaza** Strip is exposed to a war crime and a crime against humanity, according to international laws", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:28 (Gaza Time)\n\nEgyptian Foreign Minister: The Egyptian vision is based on the non -factional committee to manage the **Gaza** Strip for a period of 6 months after the ceasefire", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:27 (Gaza Time)\n\n**#Urgent **** ... \n\nAn air raid targeting the citizen's house: Dakhil Saadallah in the Al -Nazla area, west of **Jabalia**, in the northern **Gaza** Strip. **", "🔗 [Victims]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:28 (Gaza Time)\n\n4 victims to bomb the IF, waiting for aid, near Al -Tahlia roundabout, east of Khan Yunis:\n\nIsmail Akram Abdel -Masry\nRamez Mohamed Ahmed Muammar\nMohamed Ahmed Mohsen Muammar\nMohsen Muhammad Mohsen Muammar", "📢 [Announcement]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:28 (Gaza Time)\n\n** The Ministry of Health in **Gaza**: 76 children and 10 adults died due to hunger and malnutrition in the Strip **", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 18:28 (Gaza Time)\n\nStatement of the Palestinian factions: We hold Netanyahu and his government responsible for genocide and the war of starvation against the most residents of the **Gaza** Strip", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:29 (Gaza Time)\n\nEgyptian Foreign Minister: The international community rejects plans to displace Palestinians in **Gaza**, and this is a red line for Egypt and will not be allowed", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:29 (Gaza Time)\n\n** 🚫 **** Al -Nazla area west of **Jabalia** is a fog due to the continuous shelling by the aircraft and IF mechanisms there. **", "📢 [Announcement]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:31 (Gaza Time)\n\n** Urgent Egyptian Foreign Minister: The Egyptian vision is based on the non -factional committee to manage the **Gaza** Strip for a period of 6 months after the ceasefire\nUrgent Egyptian Foreign Minister: The international community rejects plans to displace Palestinians in **Gaza**, and this is a red line for Egypt and will not be allowed\nUrgent The Egyptian Foreign Minister: It is time to give hope to the Palestinian people that the international community will not let it down as it did in the past **", "⚠️ [Safety]\n📰 [**Moamen Meqdad**]\n🕒 Date : 20/07/2025 18:32 (Gaza Time)\n\n** Fox News on an Israeli official: **\nIsrael is in talks with three countries in the region on the possibility of carrying out air landing operations in **Gaza**", "🧠 [Analysis]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:33 (Gaza Time)\n\n** Al -Quds Brigades: Scenes of the composite qualitative process that targeted a soldier; With the aim of capturing a number of IF soldiers, in the Abbasan Grand area, east of Khan Yunis **.", "🔗 [Victims]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:33 (Gaza Time)\n\nCivil Defense in **Gaza**: a member of our crews was killed and 5 others were injured as a result of the IF directly targeting a point of our human area in Ma’is Khan Yunis", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:34 (Gaza Time)\n\nThe IF target houses near the Khala station in the **Jabalia** Al -Nazla area, in the northern **Gaza** Strip.", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:34 (Gaza Time)\n\nUnidentified victims from the logic of Zikim", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:34 (Gaza Time)\n\nTargeting Al -Mashsh Tower on Al -Galaa Street, northwest of **Gaza** City.", "📢 [Announcement]\n📰 [**Aljazeera**]\n🕒 Date : 20/07/2025 18:35 (Gaza Time)\n\nFox News on an Israeli official: An air landing of aid is being discussed on the **Gaza** Strip with 3 regional countries", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:36 (Gaza Time)\n\n** How did you reach us ..\n\nAn unidentified victim is a god of three days.", "📢 [Announcement]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:39 (Gaza Time)\n\n** Journalist Dia Abu Aoun\nIf you visited a house in **Gaza**\nYou find indescribable hospitality and generosity\nNow the people of glory and generosity die hunger **", "📢 [Announcement]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:39 (Gaza Time)\n\nMedical sources: 90 victims at the IF fire in the **Gaza** Strip since dawn today, including 73 aid applicants.", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:41 (Gaza Time)\n\nThe victim was identified: Muhammad Mamdouh Ali Al -Ghazzawi", "💥 [Shelling]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:41 (Gaza Time)\n\nThe IF target an apartment inside the \"Al -Malash\" building on Al -Galaa Street, north of **Gaza** City.", "🔗 [Victims]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:44 (Gaza Time)\n\n🔴 ** 93 victims with the IF fire since dawn today, including 74 aid applicants **", "🔫 [Shooting]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:45 (Gaza Time)\n\n** A painful scene ..\n\nIbrahim wanted a loaf of bread only in the shadow of the fierce star war, but he rose as a victim in the bosom of his father, in the massacre of the IF against those who were agitated in the \"Zikim\" area. **", "⚠️ [Safety]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 18:46 (Gaza Time)\n\n** Urgent Israeli Channel 12: The deportation of a New Zealand tournament to her country tomorrow, she was arrested at the beginning of the month due to documenting activities of Israeli soldiers and disturbing their work **", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:46 (Gaza Time)\n\n**#Urgent **** ... \n\nA victim arrived at Al -Awda Hospital in Al -Nasayrat, where he was pulled from the Nightsarim area north of the Central Governorate, which is:\n\n- Ahmed Anwar Al -Awawdeh **", "🔗 [Victims]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:48 (Gaza Time)\n\nAl -Shifa Medical Complex: 79 victims and 520 wounded victims", "⚠️ [Safety]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:48 (Gaza Time)\n\nScenes of an ambush carried out by the Al -Quds Brigades against the IF, east of Khan Yunis, in the **Gaza** Strip\n\nhttps://youtu.be/sh0ozae7sak", "⚠️ [Safety]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:51 (Gaza Time)\n\n** How did you arrive ..\n\nLoss: Adel Imad Al -Ashqar, a resident of Beit Lahia, ..\n- He was lost while he was the vicinity of aid truck waiting area in the Sudanese region.\n\n- We hope for those who saw it or possess any communication information. Thank you for the number: \n0599905514 **", "💥 [Shelling]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:52 (Gaza Time)\n\n**#Urgent **** ... \n\nArtillery shelling targeting separate areas of **Jabalia** in the northern **Gaza** Strip .. **", "💥 [Shelling]\n📰 [**Osama Al-Kahlout**]\n🕒 Date : 20/07/2025 18:53 (Gaza Time)\n\n*(Fox News) on an Israeli official: Israel is in talks with three countries in the region about the possibility of carrying out air landing operations in **Gaza***\n*(Fox News) On the authority of an Israeli official: One of the three countries is planning an activity to proceed with the air landing and the discussions began three weeks ago*\n*90 victims with the fire of the IF since dawn today, including 73 aid applicants*\nThe IF aircraft bombed homes near the Khala station in the **Jabalia** Al -Nazla area, in the northern **Gaza** Strip\n\nThe IF is bombing an apartment inside the \"Al -Malash\" building on Al -Galaa Street, north of **Gaza** City", "📢 [Announcement]\n📰 [**Aljazeera Mubasher**]\n🕒 Date : 20/07/2025 18:54 (Gaza Time)\n\nIn a statement, the Muslim Brotherhood called for the general aversion and urgent work because the people of **Gaza** did not leave the starvation and death machine alone.\n\n- It demanded that the crossings be opened immediately and the raising of all barriers to the flow of humanitarian aid to the Strip and the support of the people of **Gaza** with all possible support means.\n\n- The group considered that the continued closure of the crossings and the deprivation of relief convoys, medicine and food from reaching the people of **Gaza** to participate in the crime, no matter how complicity tried to decorate it with flimsy pretexts.\n\n- The statement indicated that the Zionist persistence in **Gaza** would not have happened had it not been for this disgraceful failure and the tight closure of the crossings and borders.\n\n- The group emphasized that jihad is an imposition of an eye that is not permissible to fail it, and does not fall from anyone until the aggression is defeated and the darkness raises, and this assignment does not stop with the people of **Gaza**.", "⚠️ [Safety]\n📰 [**Al-Qastal News Jerusalem**]\n🕒 Date : 20/07/2025 18:58 (Gaza Time)\n\nClashes in the town of Tuqa, southeast of **Bethlehem**, and the IF are shot and gas canisters towards the young men.", "🔗 [Victims]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 18:59 (Gaza Time)\n\nLoss of a child at the Rafidain School in Sheikh Radwan, to dress the dress of Tiger Bani Al -Rajaa, who is recognized by communication on the number:\n\n0594868645", "📢 [Announcement]\n📰 [**Osama Al-Kahlout**]\n🕒 Date : 20/07/2025 19:00 (Gaza Time)\n\n| updated .. ** 14 victims after the Israeli bombing of the university college building that houses displaced people west of Khan Yunis, south of the **Gaza** Strip: **\n\n1. Hassan Hassouneh Al -Qida\n2. Hani Muhammad Muhammad Dabour\n3. Saleh Omar Atwa Al -Shamali \n4. Edge Walid Al -Shena\n5. Haytham Samir Sabry Al -Qudra\n6. Muhammad Ibrahim Ahmed Al -Sattari\n7. Ibrahim Ahmed Suleiman Al -Sattari \n8. Hamza Muhammad Ahmed Al -Farrak\n9. Atef Farraj Abu Marouf\n10. Faraj Shafiq Faraj Abu Marouf \n11. Mahdi Salim Sabri Al -Qidra\n12. Fafras Jouda Khamis Al -Akkad \n13. Ahmed Awad Tawfiq Ayyad\n**unknown.**\n\n#Urgent ** Sources in **Gaza** Hospitals: 104 victims with the fire of the IF since dawn today, including 78 aid applicants **.", "📢 [Announcement]\n📰 [**Activist Hamza Al-Masry**]\n🕒 Date : 20/07/2025 19:02 (Gaza Time)\n\nA father with his child instead of being in a luxurious restaurant. Or in a warm family who eat food \nThey eat it from a garbage container.\n**Gaza**. 2025", "🗣️ [Statement]\n📰 [**Ramallah News**]\n🕒 Date : 20/07/2025 19:03 (Gaza Time)\n\nOne of the most skilled doctors has become in **Ramallah** ✊\nDr. Mohamed Idais, a specialist in rheumatism and joint diseases, and the owner of large and wide expertise from Egypt and Cairo Hospitals, begins his work in **Ramallah** on Monday, where the doctor specializes in: \nالمرية Immune diseases: (rheumatoid, arthritis, lupus lupus, immune vertebral stabilizer, sarcoid, Bahgat disease, skin sclerosis, immune muscle weakness, immune inflammation of the eye).\nالمل The joints and spine pain.\n📌 osteoporosis.\nالملار joint pain and muscles.\nNerve and tendon infections.\nGout and Mediterranean fever.\nFibromyalgia.\n👈 Advanced treatments include:\n📌 Joint injection (cortisone, oil needles).\n📌 Treating neck pain, shoulder and chronic spine using nervous track injection techniques.\n📌 With Dr. Mohamed Majid Idais, you will find integrated medical care to relieve pain and restore movement in quality and safety.\nBook your appointment now and prepare for a more comfortable and active life\nFor reservations and inquiries, please contact us through the following numbers:\n📞 ☎️ Phone number: 0562555845 /022923630\nThis is their page on Facebook M [**Ramallah** Specialized Medical focus] (https://www.facebook.com/**ramallah**.medical.Centter)"]